<script>
	import history_2020 from '$lib/images/history/history_2020_01.png';
	import history_2021 from '$lib/images/history/history_2021_01.png';
	import history_2022 from '$lib/images/history/history_2022_01.png';
	import history_2023 from '$lib/images/history/history_2023_01.png';
	import history_2024 from '$lib/images/history/history_2024_01.png';

	const histories = [
		{
			year: 2020,
			image: history_2020,
			content:
				'2020년 7월 10일 금요일, 파브스커피를 오픈했던 날이 생각납니다. 자영업자로서의 첫 날이자 커피를 시작한 날 이라고 할 수 있었던 그 날, 동네 많은 분들의 관심과 사랑 속에 거진 100팀 이상의 손님들이 몰려왔습니다. 코로나가 점점 심해지던 시기 새절역에 들어선 의문의 카페에 대한 궁금증과 호기심이 얼마나 컸는지 알 수 있는 날 이었습니다. 그 해도 올해처럼 무더웠던 6월이었습니다. 셀프 인테리어를 하던 저희 부부에게, 우리에게 동네에 카페가 들어온다며 기대된다고 응원을 더 해주셨던 순간들이 떠오르네요. 파브스의 첫 블렌드 원두인 모건타운 블렌드를 만들기 위해 밤 낮으로 로스팅과 커핑(cupping)을 하던 중 커핑폼의 카테고리가 눈에 들어왔습니다. 아! 이거다! 커핑폼에 적혀있는 Flavor, Aroma, Acidity, Body, Sweetness의 철자들이 머리속에서 퍼즐처럼 맞춰져 FAABS라는 이름을 만들게 되었습니다. 그래, 이렇게 커피를 하며 살기로 결심한 인생, 우리만의 맛과 향 그리고 커피의 경험을 제공해보자. 그렇게 파브스가 시작되었습니다.'
		},
		{
			year: 2021,
			image: history_2021,
			content:
				'2021년 파브스가 맞이한 첫 번째 새해는 팬데믹, 백신 개발, 백신 접종, 거리두기, 영업 제한 등 마스크 의무 착용의 시기였습니다. 파브스가 2021년을 버틸 수 있었던 건 동네 분들의 응원과 사랑이라는 말 밖에는 할 수 없을겁니다. 힘내라며 부침개를 구워서 가져다 주신 단골 할머니, “파브스가 문을 닫으면 갈 곳이 없어요?”라며 손 편지를 건네주던 손님. 매일 매일 찾아와주시는 손님들과 마스크 착용으로 눈만 마주칠 수 있었지만 항상 마스크 안의 입은 밝은 미소와 힘찬 에너지로 손님들을 맞았습니다. 그렇게 버틴다는 표현도 늘 잘 해내고 있다는 표현이 더 어울릴 만큼 우리의 2021년은 끈끈했습니다. 그리고 감사했습니다. 봄에 찾아온 뜻깊은 소식은 2021년 첫 임신 소식이었습니다. 물론, 10월 출산까지 만삭의 몸이 되도록 일하는 임산부 바리스타를 걱정하는 눈길도 있었습니다. 임신과 출산은 여성 바리스타로서의 직업에 대해 진지하게 고민하고 마주해야 하는 현실이었습니다. 그리고 새로운 꿈을 꾸게 하는 시작이기도 했습니다. 임산부가 되고 엄마가 되며, 바리스타라는 직업을 더 간절하게 하고 싶어졌으니까요.'
		},
		{
			year: 2022,
			image: history_2022,
			content:
				"2022년 5월, 아이들을 출산한 지 7개월이 될 때, 제가 이 직업을 계속할 수 있을까에 대한 질문이 스스로에게 생겼습니다. 육아와 일을 함께 해내고 싶었습니다. 잠 못 이루던 새벽 KNBC(Korea National Barista Championship) 추가 모집 공고를 보았습니다. 바리스타 챔피언십을 20일 앞둔 새벽, 이걸 도전해야겠다는 강한 열망이 생겼습니다. 신청을 하고 다음날부터 20일 간의 준비로 6월 8일 KNBC 15분의 시연과 함께 디카페인 커피로 다양성의 존중을 주제로 대회에 참가했습니다. 나 자신과의 싸움인 대회가, 갈 길을 찾던 제게 '도전'이라는 용기를 만들어 준 경험이었습니다. 18등의 등수는 포기하지 않고 해내었다라는 의미에 있어서 제겐 너무나 큰 성과였습니다. 파브스를 계속 해내야지, 아이들도 잘 키워내야지, 그리고 커피를 계속 해야지 라는 동기부여와 응원을 만들어낸 시간이었습니다. 2022, 2023, 2024 그렇게 3년 간 3번의 KNBC 도전을 만들어 준 소중한 시작점이었습니다. 대회를 통해 얻은 것은 도전, 성장, 배움 등이 있습니다. 그리고 파브스 커피가 매장 운영 뿐만 아니라, 로스팅과 추출에 있어서 더 디테일하게 공부하는 자극제가 되기도 했습니다. 그렇게 파브스커피와 대회의 인연이 시작되었습니다."
		},
		{
			year: 2023,
			image: history_2023,
			content:
				'2023년은 로스팅에 있어서 묵묵하게 걷던 우리에게 작은 기쁨을 얻은 해입니다. 이준선 대표가 KCRC(Korea Coffee Roasting Championship)에서 5위를 하게 되었습니다. 물론 대회 수상이 무언가를 증명해주거나 하는 것은 없습니다. 다만, 대회에 나가기 위해 수많은 시간을 몰입하고 노력하는 강제 노력을 만들어준게 가장 큰 수확이라 생각합니다. 매장을 운영하다보면 밸런스를 맞추는 것이 중요한데, 운영과 성장, 커피공부와 연구 등이 병행되어 함께 키워나가는데 로스팅 대회 참가는 파브스의 로스팅 공부에 좋은 선생님이 되어주었습니다.'
		},
		{
			year: 2024,
			image: history_2024,
			content:
				'파브스 커피가 생긴 지 4년이 되는 해이며, 5년차에 접어드는 시기입니다. 저는 다시 처음으로 돌아간 느낌이 많이 듭니다. 4년의 시간은 마치 연습같았고, 기억의 한편으로 흘러갔습니다. 다시 시작하고 싶습니다. 더 간절하게 더 감사한 마음으로 파브스의 존재와 운영에 대해 소중함을 전하고 싶습니다. 파브스는 커피를 하며 <커피 생산자와 소비자의 연결 다리>가 되고 싶습니다. 파브스는 커피 한 잔에 담긴 다양한 이야기를 커피와 함께 전달하고 싶습니다. 나라, 지역, 프로세싱, 생산자, 유통과정, 로스팅, 추출 등 seed to cup에 이르는 일련의 과정에 대해 알려줄 수 있는 건, 바로 이 커피를 다루는 로스터, 바리스타라고 생각합니다. 커피 한 잔의 가치를 소비자에게 전달할 때 스페셜티 커피의 가치는 더 소중해지고 이 산업과 직업의 지속가능성은 커질거라 믿고 있으니까요.'
		}
	];
</script>

{#each histories as h}
	<div class="py-10">
		<div class="flex">
			<p class="text-2xl">{h.year}</p>
			<div class="mb-4 ml-5 w-full border-b border-gray-500"></div>
		</div>
		<img src={h.image} class="mt-2 w-full rounded-xl p-1" alt="" />
		<div class="p-4 indent-2 text-lg font-light leading-loose tracking-wide">
			{h.content}
		</div>
	</div>
{/each}
